INSERT INTo genre
VALUES 	(1, 'Рок', 'Музыка в стиле рок, тяжелый рок'),
    	(2, 'Рэп', 'Музыка в стиле рэп, hip hop'),
    	(3, 'Поп', 'Музыка в стиле поп');
    
INSERT INTO performer
VALUES	(1, 'Диана Арбенина'),
    	(2, 'Виктор Цой'),
    	(3, 'Баста'),
    	(4, 'Дима Билан'),
    	(5, 'Валерий Меладзе'),
    	(6, 'Гуф');
    
INSERT INTO performer_ganre
VALUES	(1, 1),
    	(2, 1),
    	(3, 2),
    	(4, 3), 
    	(5, 3),
    	(6, 2);

INSERT INTO album
VALUES	(1, 'Раскаленные', 2018),
		(2, 'Группа крови', 1996),
    	(3, 'Моя Вселенная', 2012),
    	(4, 'Вторая жизнь', 2021),
    	(5, 'Вижу солнце', 2020),
    	(6, 'Дома', 2009);
    
INSERT into track
VALUES	(1, 'Мой инстаграм', 202.2, 1),
		(2, 'Секунду назад', 211.8, 1),
        (3, 'Стук', 210.6, 2),
        (4, 'Война', 243.6, 2),
        (5, 'Наше лето', 283.4, 3),
        (6, 'Помни', 146.4, 3),
        (7, 'Держи', 181.2, 4),
        (8, 'Молния', 181.2, 4),
        (9, 'Сахара не надо', 201.6, 5),
        (10, 'Текила любовь', 205.8, 5),
        (11, 'Мой дом', 259.8, 6),
		(12, 'Письмо домой', 262.2, 6);

insert into collection
values 	(1, 'Рок сборник', 2021),
		(2, 'Рэк сборник', 2021),
        (3, 'Поп сборник', 2023),
        (4, 'Микс сборник', 2020);
        
INSERT INTO track_collection
VALUES	(1, 1),
		(2, 1),
        (3, 1),
       	(4, 1),
       	(5, 2),
       	(6, 2),
        (7, 3),
        (8, 3),
        (9, 3),
        (10, 3),
        (11, 2),
        (12, 2),
       	(5, 4),
        (8, 4),
       	(11, 4),
        (3, 4);
INSERT INTO genre_album
VALUES  (1,1),
		(1,2),
		(2,3),
		(3,4),
		(3,5),
		(2,6);